package Lesson04.Task1;

public class Main {

    public static void main(String[] args) {
	// Написать программу для поиска минимального из двух чисел.
        System.out.println("Lesson04.Task1");
        int i1=7;
        int i2=6;
        if (i1<i2) {System.out.println("Min number is i1="); System.out.println(i1);}
        else {System.out.println("Min number is i2=");System.out.println(i2);}
    // Написать программу, которая описывает введенное число.
    // Отрицательное оно число или положительное (или нулевое), чётное или нечётное.
        int j=6;


    // Написать программу для вывода на экран таблицы умножения.

    // Написать программу, которая выводит арифметическую или геометрическую прогрессию для N чисел.

    }
}
