package Lesson04.Task1;

public class Main {

    public static void main(String[] args) {
	// Написать программу для поиска минимального из двух чисел.
        int i1=7;
        int i2=6;
        if (i1<i2) System.out.println(i1); else System.out.println(i2);
    }
}
